Revit 2024 API
DividedPath.IsClosedLoop Property
 Whether or not the path forms a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsClosedLoop { get; }
Visual Basic
Public ReadOnly Property IsClosedLoop As Boolean
	Get
Visual C++
public:
property bool IsClosedLoop {
	bool get ();
}
Remarks
 True if the path form a closed loop. False otherwise.
See Also
DividedPath Class
Autodesk.Revit.DB Namespace